---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StonePattern
source: html/660188c4-0630-02ef-e139-ecb54791e76f.htm
---
# Autodesk.Revit.DB.Visual.Stone.StonePattern Property

The property labeled "Relief Pattern" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StonePattern { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StonePatternType".